In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import StandardScaler,LabelEncoder,PolynomialFeatures
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_absolute_error,mean_squared_error,r2_score

In [2]:
file_path = "Position_Salaries.csv"
df = pd.read_csv(file_path)
df.head()

            Position  Level  Salary
0   Business Analyst      1   45000
1  Junior Consultant      2   50000
2  Senior Consultant      3   60000
3            Manager      4   80000
4    Country Manager      5  110000

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Position  10 non-null     object
 1   Level     10 non-null     int64
 2   Salary    10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes

In [6]:
scaler = StandardScaler()
df[['Level']] = scaler.fit_transform(df[['Level']])
df.head()

            Position     Level  Salary
0   Business Analyst -1.566699   45000
1  Junior Consultant -1.218544   50000
2  Senior Consultant -0.870388   60000
3            Manager -0.522233   80000
4    Country Manager -0.174078  110000

In [7]:
encoder = LabelEncoder()
df['Postition'] = encoder.fit_transform(df['Position'])
df.head()

            Position     Level  Salary  Postition
0   Business Analyst -1.566699   45000          0
1  Junior Consultant -1.218544   50000          4
2  Senior Consultant -0.870388   60000          8
3            Manager -0.522233   80000          5
4    Country Manager -0.174078  110000          3